InformationRegisters/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Название</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючУникальностиЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВремениГрафика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСобытия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_ЗанятоеВремяЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ЗанятоеВремяЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.омг_СторонниеВрачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/омг_ИзмененияГрафиковРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>омг_ИзмененияГрафиковРабот</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>УстановкаГрафиковРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаГрафиковРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/омг_Idoctor/Ext/Module.bsl
&НаСервере
Процедура ОтправитьРасписаниеНаСервере(Сотрудник = Неопределено, Филиал = Неопределено, Дата = Неопределено, Сотрудники = Неопределено) Экспорт	
	
	УстановитьПривилегированныйРежим(Истина);
	
	HTTP = Новый HTTPСоединение("ext.idoctor.kz",,"testovDiv@gmail.com","Qwerty123!",,,Новый ЗащищенноеСоединениеOpenSSL(),);

	Запрос = Новый Запрос; 
	ТекстУсловия1 = ""; 
	ТекстУсловия2 = "";
	
	Если не Сотрудник = Неопределено Тогда
		
		ТекстУсловия1 = " 
		|	И ГрафикиРаботы.Сотрудник = &Сотрудник
		|";
		
		ТекстУсловия2 = " 
		|	И омг_ЗанятоеВремяЗаявок.Сотрудник = &Сотрудник
		|";
			
		Запрос.УстановитьПараметр("Сотрудник",Сотрудник);
		
	ИначеЕсли не Сотрудники = Неопределено Тогда
		
		ТекстУсловия1 = " 
		|	И ГрафикиРаботы.Сотрудник в (&Сотрудники)
		|";
		
		ТекстУсловия2 = " 
		|	И омг_ЗанятоеВремяЗаявок.Сотрудник в (&Сотрудники)
		|";
				
		Запрос.УстановитьПараметр("Сотрудники",Сотрудники);	 
		
	КонецЕсли;
		
	Если Дата = Неопределено Тогда  
		ДатаНачалаИ	 =  ТекущаяДата();
		ДатаОкончанияИ =  ДобавитьМесяц(ДатаНачалаИ,1);	
	иначе	
		ДатаНачалаИ	 =  Дата;
		ДатаОкончанияИ =  Дата;		
	КонецЕсли;    

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрафикиРаботы.Филиал КАК Филиал,
	|	ГрафикиРаботы.Филиал.Наименование КАК ФилиалНаименование,
	|	ГрафикиРаботы.Филиал.омг_idoctorId КАК ФилиалКод,
	|	ГрафикиРаботы.Сотрудник КАК Сотрудник,
	|	ГрафикиРаботы.Сотрудник.омг_idoctorId КАК СотрудникКод,
	|	ГрафикиРаботы.ВремяНачала КАК ВремяНачала,
	|	ГрафикиРаботы.ВремяОкончания КАК ВремяОкончания,
	|	ГрафикиРаботы.Дата КАК Дата,
	|	ГрафикиРаботы.Сотрудник.ДлительностьПриема КАК СотрудникДлительностьПриема,
	|	ГрафикиРаботы.Сотрудник.Имя КАК firstName, 
	|	ГрафикиРаботы.Сотрудник.Фамилия КАК lastName,
	|	ГрафикиРаботы.Сотрудник.Отчество КАК patronymic,
	|	ГрафикиРаботы.Сотрудник.Наименование КАК fullName
	|ИЗ
	|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
	|ГДЕ
	|	ГрафикиРаботы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|"
	+ ТекстУсловия1 +	
	"	СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботы.Филиал,
	|	ГрафикиРаботы.Филиал.Наименование,
	|	ГрафикиРаботы.Сотрудник,
	|	ГрафикиРаботы.Дата,
	|	ГрафикиРаботы.Сотрудник.ДлительностьПриема,
	|	ГрафикиРаботы.ВремяНачала,
	|	ГрафикиРаботы.ВремяОкончания,
	|	ГрафикиРаботы.Филиал.омг_idoctorId,
	|	ГрафикиРаботы.Сотрудник.омг_idoctorId,
	|	ГрафикиРаботы.Сотрудник.Имя, 
	|	ГрафикиРаботы.Сотрудник.Фамилия,
	|	ГрафикиРаботы.Сотрудник.Отчество,
	|	ГрафикиРаботы.Сотрудник.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Филиал,
	|	Сотрудник,
	|	Дата
	|ИТОГИ ПО
	|	Филиал,
	|	Сотрудник,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_ЗанятоеВремяЗаявок.Сотрудник КАК Сотрудник,
	|	омг_ЗанятоеВремяЗаявок.ДатаНачала КАК ДатаНачала,
	|	омг_ЗанятоеВремяЗаявок.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.омг_ЗанятоеВремяЗаявок КАК омг_ЗанятоеВремяЗаявок
	|ГДЕ
	|	омг_ЗанятоеВремяЗаявок.ДатаНачала МЕЖДУ &ДатаНачала И &ДатаОкончания
	|"
	+ ТекстУсловия2;
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачалаИ));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончанияИ));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЗанятоеВремя = РезультатЗапроса[1].Выбрать();	
	
	ВыборкаФилиал = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаФилиал.Следующий() Цикл
		
		ВыборкаСотрудник = ВыборкаФилиал.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСотрудник.Следующий() Цикл
			// Формируем структуру шапки
			medcenter = Новый Структура("id,name",ВыборкаСотрудник.ФилиалКод,ВыборкаСотрудник.ФилиалНаименование);
			doctor = Новый Структура("id,firstName,lastName,patronymic,fullName",ВыборкаСотрудник.СотрудникКод,ВыборкаСотрудник.firstName,ВыборкаСотрудник.lastName,ВыборкаСотрудник.patronymic,ВыборкаСотрудник.fullName);

			//ДанныеОРасписании.Вставить("medcenterId",Число(ВыборкаСотрудник.ФилиалКод)); 
			//ДанныеОРасписании.Вставить("medcenter",medcenter);
			//ДанныеОРасписании.Вставить("doctorId",Число(ВыборкаСотрудник.СотрудникКод));
			//ДанныеОРасписании.Вставить("doctorName", ВыборкаСотрудник.СотрудникНаименование);
			//ДанныеОРасписании.Вставить("cabinetName","");
			
			schedules = Новый Массив;	
			
			ДлительностьПриема = ?(ЗначениеЗаполнено(ВыборкаСотрудник.СотрудникДлительностьПриема),ВыборкаСотрудник.СотрудникДлительностьПриема - Дата(1,1,1) ,30 * 60);	 
			
			ВыборкаДата = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДата.Следующий() Цикл		
				
				ВыборкаДетальныеЗаписи = ВыборкаДата.Выбрать();
				ТаблицаГрафика = Новый ТаблицаЗначений;
				ТаблицаГрафика.Колонки.Добавить("ДатаВремяНачалаСлот",Новый ОписаниеТипов("Дата"));  
				ТаблицаГрафика.Колонки.Добавить("ДатаВремяОкончанияСлот",Новый ОписаниеТипов("Дата"));
				ТаблицаГрафика.Колонки.Добавить("Сотрудник",Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
				timeslots = Новый Массив;	
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
					
					ДатаВремяОкончанияСлот = Дата(1,1,1);
					ДатаВремяНачалаСлот = ВыборкаДетальныеЗаписи.Дата + (ВыборкаДетальныеЗаписи.ВремяНачала - Дата(1,1,1));
					ДатаВремяОкончанияСмены = ВыборкаДетальныеЗаписи.Дата + (ВыборкаДетальныеЗаписи.ВремяОкончания - Дата(1,1,1));
					
					Пока ДатаВремяОкончанияСмены > ДатаВремяОкончанияСлот Цикл
						
						ДатаВремяОкончанияСлот =  ДатаВремяНачалаСлот + ДлительностьПриема;  
						СтрокаТаблицаГрафика = ТаблицаГрафика.Добавить();
						СтрокаТаблицаГрафика.ДатаВремяНачалаСлот = ДатаВремяНачалаСлот;
						СтрокаТаблицаГрафика.ДатаВремяОкончанияСлот = ДатаВремяОкончанияСлот;
						СтрокаТаблицаГрафика.Сотрудник              =  ВыборкаДетальныеЗаписи.Сотрудник;					
						ДатаВремяНачалаСлот = ДатаВремяОкончанияСлот; 
						
					КонецЦикла; 
				КонецЦикла; 
								
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТаблицаГрафик.ДатаВремяНачалаСлот КАК ДатаВремяНачалаСлот,
				|	ТаблицаГрафик.ДатаВремяОкончанияСлот КАК ДатаВремяОкончанияСлот,
				|	ТаблицаГрафик.Сотрудник КАК Сотрудник
				|ПОМЕСТИТЬ ВтТаблицаГрафик
				|ИЗ
				|	&ТаблицаГрафик КАК ТаблицаГрафик
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВтТаблицаГрафик.ДатаВремяНачалаСлот КАК ДатаВремяНачалаСлот,
				|	ВтТаблицаГрафик.ДатаВремяОкончанияСлот КАК ДатаВремяОкончанияСлот,
				|	ВЫБОР
				|		КОГДА ВтТаблицаГрафик.ДатаВремяНачалаСлот >= омг_ЗанятоеВремяЗаявок.ДатаНачала
				|					И ВтТаблицаГрафик.ДатаВремяОкончанияСлот <= омг_ЗанятоеВремяЗаявок.ДатаОкончания
				|				ИЛИ ВтТаблицаГрафик.ДатаВремяНачалаСлот > омг_ЗанятоеВремяЗаявок.ДатаНачала
				|					И ВтТаблицаГрафик.ДатаВремяНачалаСлот < омг_ЗанятоеВремяЗаявок.ДатаОкончания
				|				ИЛИ ВтТаблицаГрафик.ДатаВремяОкончанияСлот > омг_ЗанятоеВремяЗаявок.ДатаНачала
				|					И ВтТаблицаГрафик.ДатаВремяОкончанияСлот < омг_ЗанятоеВремяЗаявок.ДатаОкончания
				|			ТОГДА ЛОЖЬ
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ КАК isAvailable
				|ИЗ
				|	ВтТаблицаГрафик КАК ВтТаблицаГрафик
				|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.омг_ЗанятоеВремяЗаявок КАК омг_ЗанятоеВремяЗаявок
				|		ПО ВтТаблицаГрафик.Сотрудник = омг_ЗанятоеВремяЗаявок.Сотрудник
				|ГДЕ
				|	НАЧАЛОПЕРИОДА(омг_ЗанятоеВремяЗаявок.ДатаНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
				|	И омг_ЗанятоеВремяЗаявок.Сотрудник = &Сотрудник
				|	И омг_ЗанятоеВремяЗаявок.Регистратор.Филиал = &Филиал";
				
				Запрос.УстановитьПараметр("ТаблицаГрафик",ТаблицаГрафика); 
				Запрос.УстановитьПараметр("Сотрудник",ВыборкаСотрудник.Сотрудник);   
				Запрос.УстановитьПараметр("НачалоПериода",ВыборкаДата.Дата);
				Запрос.УстановитьПараметр("Филиал",ВыборкаДата.Филиал);
				
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДетальныеЗаписиСЗанятыми =  РезультатЗапроса.Выбрать();   
				ЕстьЗаписи = Ложь;
				Пока ВыборкаДетальныеЗаписиСЗанятыми.Следующий() Цикл
					ЕстьЗаписи = Истина; 
					timeslotsСтр = Новый Структура();
					timeslotsСтр.Вставить("startAt","" + Формат(ВыборкаДетальныеЗаписиСЗанятыми.ДатаВремяНачалаСлот, "ДФ='yyyy-MM-dd HH:mm:ss'"));
					timeslotsСтр.Вставить("endAt","" +  Формат(ВыборкаДетальныеЗаписиСЗанятыми.ДатаВремяОкончанияСлот, "ДФ='yyyy-MM-dd HH:mm:ss'"));
					timeslotsСтр.Вставить("isAvailable",ВыборкаДетальныеЗаписиСЗанятыми.isAvailable);
					timeslots.Добавить(timeslotsСтр);
				КонецЦикла;  
				
				Если ЕстьЗаписи = Ложь Тогда 
					Для каждого СтрокаТабГрафика из ТаблицаГрафика Цикл
						timeslotsСтр = Новый Структура();
						timeslotsСтр.Вставить("startAt","" + Формат(СтрокаТабГрафика.ДатаВремяНачалаСлот, "ДФ='yyyy-MM-dd HH:mm:ss'"));
						timeslotsСтр.Вставить("endAt","" +  Формат(СтрокаТабГрафика.ДатаВремяОкончанияСлот, "ДФ='yyyy-MM-dd HH:mm:ss'"));
						timeslotsСтр.Вставить("isAvailable",Истина);
						timeslots.Добавить(timeslotsСтр);
					КонецЦикла;  
				КонецЕсли;
				
				schedulesСтруктура = Новый Структура;
				schedulesСтруктура.Вставить("date","" + Формат(ДатаВремяОкончанияСмены, "ДФ='yyyy-MM-dd'"));
				schedulesСтруктура.Вставить("timeslots",timeslots);	
				schedules.Добавить(schedulesСтруктура);
				
			КонецЦикла; 
			
			ДанныеОРасписании = Новый Структура("medcenter,doctor,cabinetName,schedules",medcenter,doctor,"",schedules);

			//ДанныеОРасписании.Вставить("schedules",schedules);
			
			//сериализуем в json
			ЗаписьJSON = Новый ЗаписьJSON;               
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, ДанныеОРасписании);
			СтрокаДляТела = ЗаписьJSON.Закрыть();
			
			// Отправка
			
			//заголовок создадим в виде соответствия
			//ЗаголовокЗапросаHTTP = Новый Соответствие();
			////передаем в заголовках размер и тип данных на отправку
			//ЗаголовокЗапросаHTTP.Вставить("X-Integration-Key", "1c");
			//ЗаголовокЗапросаHTTP.Вставить("X-Integration-Auth-Key", "vLfWU44yp7U");
			//ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
			////создадим заголовок запроса
			//ЗапросHTTP = Новый HTTPЗапрос("/mis-api/v2/webhooks/schedule", ЗаголовокЗапросаHTTP);
			////загрузить строку в тело
			//ЗапросHTTP.УстановитьТелоИзСтроки(СтрокаДляТела);
			////отсылаем POST-запрос на обработку.
			//ОтветHTTP = HTTP.ОтправитьДляОбработки(ЗапросHTTP);
			
		КонецЦикла;
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры      

 &НаСервере
Функция ПроверитьРасписаниеНаСервере(doctorId,medcenterId,startAt,endAt,Дата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрафикиРаботы.Филиал КАК Филиал,
	|	ГрафикиРаботы.Филиал.Код КАК ФилиалКод,
	|	ГрафикиРаботы.Сотрудник КАК Сотрудник,
	|	ГрафикиРаботы.Сотрудник.Код КАК СотрудникКод,
	|	ГрафикиРаботы.ВремяНачала КАК ВремяНачала,
	|	ГрафикиРаботы.ВремяОкончания КАК ВремяОкончания,
	|	ГрафикиРаботы.Дата КАК Дата,
	|	ГрафикиРаботы.Сотрудник.ДлительностьПриема КАК СотрудникДлительностьПриема
	|ИЗ
	|	РегистрСведений.ГрафикиРаботы КАК ГрафикиРаботы
	|ГДЕ
	|	ГрафикиРаботы.ВремяНачала <= &ВремяНачала
	|	И ГрафикиРаботы.Филиал.омг_idoctorId = &medcenterId
	|	И ГрафикиРаботы.Сотрудник.омг_idoctorId = &doctorId
	|	И ГрафикиРаботы.ВремяОкончания >= &ВремяОкончания
	|	И ГрафикиРаботы.Дата = &Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикиРаботы.Филиал,
	|	ГрафикиРаботы.Сотрудник,
	|	ГрафикиРаботы.Филиал.Код,
	|	ГрафикиРаботы.Сотрудник.Код,
	|	ГрафикиРаботы.Дата,
	|	ГрафикиРаботы.Сотрудник.ДлительностьПриема,
	|	ГрафикиРаботы.ВремяНачала,
	|	ГрафикиРаботы.ВремяОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|	Филиал,
	|	Сотрудник,
	|	Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	омг_ЗанятоеВремяЗаявок.Сотрудник КАК Сотрудник,
	|	омг_ЗанятоеВремяЗаявок.ДатаНачала КАК ДатаНачала,
	|	омг_ЗанятоеВремяЗаявок.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.омг_ЗанятоеВремяЗаявок КАК омг_ЗанятоеВремяЗаявок
	|ГДЕ
	|	омг_ЗанятоеВремяЗаявок.ДатаНачала = &ДатаНачалаЗаявки
	|	И омг_ЗанятоеВремяЗаявок.ДатаОкончания =  &ДатаОкончанияЗаявки
	|	И омг_ЗанятоеВремяЗаявок.Сотрудник.омг_idoctorId = &doctorId
	|	И омг_ЗанятоеВремяЗаявок.Регистратор.Филиал.омг_idoctorId = &medcenterId";
	
	Запрос.УстановитьПараметр("medcenterId", medcenterId);
	Запрос.УстановитьПараметр("doctorId", doctorId);
	Запрос.УстановитьПараметр("ВремяНачала", startAt);
	Запрос.УстановитьПараметр("ВремяОкончания", endAt); 
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Дата));  
	
	Запрос.УстановитьПараметр("ДатаНачалаЗаявки", Дата + (startAt - Дата(1,1,1))); 
	Запрос.УстановитьПараметр("ДатаОкончанияЗаявки", Дата + (endAt - Дата(1,1,1)));
	
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЗанятоеВремя = РезультатЗапроса[1].Выбрать();	
	
	ВыборкаСотрудник = РезультатЗапроса[0].Выбрать();
	ВозЗначение = Ложь;     
	
	Если ВыборкаСотрудник.Следующий() и не ВыборкаЗанятоеВремя.Следующий() тогда 
		ВозЗначение = Истина;
	КонецЕсли;	 
	УстановитьПривилегированныйРежим(Ложь);

	Возврат ВозЗначение; 
	   
КонецФункции    

 &НаСервере
Функция СоздатьЗаявкуНаСервере(doctorId,medcenterId,ИИН,Тел,Имя,startAt,endAt,Дата,event,омг_bookingCode,Омг_bookingId,Комментарий) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокОбъект = Неопределено;
	
	Если не event = "booking.created" Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Заявка.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заявка КАК Заявка
		|ГДЕ
		|	Заявка.Омг_bookingId = &Омг_bookingId";
		
		Запрос.УстановитьПараметр("Омг_bookingId", Омг_bookingId);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект(); 
			Если event = "booking.cancelled" Тогда
				ДокОбъект.ПометкаУдаления = Истина; 
				ДокОбъект.ОбменДанными.Загрузка = Истина;
				ДокОбъект.Проведен = Ложь;
				ДокОбъект.Записать();
			КонецЕСли;
			
		КонецЕСли;
		
	КонецЕсли;	
		
	Если event = "booking.created" или event = "booking.rebooked" и не ДокОбъект = Неопределено Тогда
		
	Врач = Неопределено;
	Клиника = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	Клиенты.ИНН = &ИИН
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.омг_idoctorId = &омг_idoctorIdВрач
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Филиалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Филиалы КАК Филиалы
	|ГДЕ
	|	Филиалы.омг_idoctorId = &омг_idoctorIdКлиника
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Заявка.Номер КАК Номер
	|ИЗ
	|	Документ.Заявка КАК Заявка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер УБЫВ";
	
	Запрос.УстановитьПараметр("ИИН", ИИН);  
	Запрос.УстановитьПараметр("омг_idoctorIdВрач", doctorId);
	Запрос.УстановитьПараметр("омг_idoctorIdКлиника", medcenterId);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаКлиент = РезультатЗапроса[0].Выбрать();
	ВыборкаВрач = РезультатЗапроса[1].Выбрать();
	ВыборкаКлиника = РезультатЗапроса[2].Выбрать();
	ВыборкаНомер = РезультатЗапроса[3].Выбрать();
	
	Если ВыборкаКлиент.Следующий() Тогда
		
		Клиент = ВыборкаКлиент.Ссылка
		
	иначе
		Клиент = Справочники.Клиенты.СоздатьЭлемент();
		Клиент.ИНН = ИИН;
		//Клиент.Имя = Имя;
		//Клиент.Фамилия = Фамилия;
		//Клиент.Отчество = Отчество; 
		СедьмойСимволИИН = Сред(ИИН,7,1); 
		ГодИИН =  Лев(ИИН,2);
		МесяцИИН =  Сред(ИИН,3,2);
		ДеньИИН =  Сред(ИИН,5,2);	
		
		Если СедьмойСимволИИН = "3" Тогда
			Клиент.Пол = Перечисления.ПолФизическихЛиц.Мужской;
			Клиент.ДатаРождения = Дата("19" + ГодИИН,МесяцИИН,ДеньИИН);
		иначеЕсли СедьмойСимволИИН = "4" Тогда
			Клиент.Пол = Перечисления.ПолФизическихЛиц.Женский;
			Клиент.ДатаРождения = Дата("19" + ГодИИН,МесяцИИН,ДеньИИН);	 
		иначеЕсли СедьмойСимволИИН = "5" Тогда
			Клиент.Пол = Перечисления.ПолФизическихЛиц.Мужской;
			Клиент.ДатаРождения = Дата("20" + ГодИИН,МесяцИИН,ДеньИИН);
		иначеЕсли СедьмойСимволИИН = "6" Тогда
			Клиент.Пол = Перечисления.ПолФизическихЛиц.Женский;
			Клиент.ДатаРождения = Дата("20" + ГодИИН,МесяцИИН,ДеньИИН); 
		Иначе
			Клиент = Неопределено
		КонецЕсли;
		Если не Клиент = Неопределено Тогда
		//Клиент.Наименование = Фамилия + " " +Имя +" "+Отчество; 
		Клиент.Наименование = Имя; 
		Клиент.Комментарий = "idoctor";
		Клиент.Записать();
		Клиент = Клиент.Ссылка;	
		Если ЗначениеЗаполнено(Тел) Тогда
			ТелКлиента = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
			ТелКлиента.Объект = Клиент;
			ТелКлиента.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
			ТелКлиента.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
			ТелКлиента.Представление = Тел; 
			ТелКлиента.Записать();
		КонецЕсли; 
		КонецЕсли;
	КонецЕсли;
	
	Если ВыборкаВрач.Следующий() Тогда
		
		Врач = ВыборкаВрач.Ссылка 
		
	КонецЕсли;
	
	Если ВыборкаКлиника.Следующий() Тогда
		
		Клиника = ВыборкаКлиника.Ссылка 
		
	КонецЕсли;   
		
	Если не Врач = Неопределено и не Клиника = Неопределено и не Клиент = Неопределено Тогда
		
		Если event = "booking.created"  Тогда		
			ДокЗаявка = Документы.Заявка.СоздатьДокумент(); 
		Иначе 
			ДокЗаявка = ДокОбъект 
		КонецЕсли; 
	
		ДокЗаявка.Клиент = Клиент;
		ДокЗаявка.Филиал = Клиника;
		ДокЗаявка.Сотрудник = Врач;
		ДокЗаявка.ДатаНачала = НачалоДня(Дата) + (startAt - Дата(01,01,01));
		ДокЗаявка.ДатаОкончания = НачалоДня(Дата) + (endAt - Дата(01,01,01));
		ДокЗаявка.ВремяНачала = startAt;
		ДокЗаявка.ВремяОкончания = endAt;
		ДокЗаявка.Состояние = Справочники.ВидыСостоянийЗаявок.СозданаНаСайте;
		ДокЗаявка.Примечание = Комментарий;
		ДокЗаявка.Дата = Дата;
		ДокЗаявка.омг_bookingCode = омг_bookingCode;
		ДокЗаявка.Омг_bookingId = Омг_bookingId; 
		ДокЗаявка.Проведен = Истина;
		ДокЗаявка.ПометкаУдаления = Ложь; 
		ДокЗаявка.Работы.Очистить();
		СтрРаботы = ДокЗаявка.Работы.Добавить();
		СтрРаботы.Продолжительность =  endAt - (startAt - Дата(01,01,01));
		СтрРаботы.Сотрудник = Врач;
		СтрРаботы.ДатаНачала = ДокЗаявка.ДатаНачала;
		СтрРаботы.ДатаОкончания = ДокЗаявка.ДатаОкончания;
		СтрРаботы.Количество = 1; 		
		Попытка
			ДокЗаявка.Записать(РежимЗаписиДокумента.Проведение); 
		Исключение
		КонецПопытки;
	КонецЕсли;

	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

КонецФункции   

Процедура омг_ОбновитьРасписаниеIDoctor() Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	омг_ИзмененияГрафиковРабот.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.омг_ИзмененияГрафиковРабот КАК омг_ИзмененияГрафиковРабот
		|
		|СГРУППИРОВАТЬ ПО
		|	омг_ИзмененияГрафиковРабот.Сотрудник";
	
	ОтправитьРасписаниеНаСервере(,,,Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	
	Набор = РегистрыСведений.омг_ИзмененияГрафиковРабот.СоздатьНаборЗаписей();
	Набор.Записать(); 
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура омг_ПриПроведенииУстановкиГрафиковРаботОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); 
	
	Если не Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УстановкаГрафиковРаботыУчастники.Участник КАК Сотрудник,
		|	УстановкаГрафиковРаботыУчастники.Ссылка КАК УстановкаГрафиковРабот,
		|	&Период КАК Период,
		|	&Регистратор КАК Регистратор
		|ИЗ
		|	Документ.УстановкаГрафиковРаботы.Участники КАК УстановкаГрафиковРаботыУчастники
		|ГДЕ
		|	НЕ УстановкаГрафиковРаботыУчастники.Участник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|	И УстановкаГрафиковРаботыУчастники.Ссылка = &Ссылка
		|	И УстановкаГрафиковРаботыУчастники.Участник.омг_idoctorНеВыгружать = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаГрафиковРаботыУчастники.Ссылка,
		|	УстановкаГрафиковРаботыУчастники.Участник";  
		
		Запрос.УстановитьПараметр("Период",Источник.Дата); 
		Запрос.УстановитьПараметр("Регистратор",Источник.Ссылка);
		Запрос.УстановитьПараметр("Ссылка",Источник.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		НаборЗаписей = РегистрыСведений.омг_ИзмененияГрафиковРабот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УстановкаГрафиковРабот.Установить(Источник.Ссылка);    
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			Если значениеЗаполнено(ВыборкаДетальныеЗаписи.Сотрудник) Тогда
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(),ВыборкаДетальныеЗаписи);
			КонецЕсли;
		КонецЦикла;
		
		НаборЗаписей.Записать();	
		
	КонецЕсли;	
	
	УстановитьПривилегированныйРежим(Ложь); 
	
КонецПроцедуры
